Stairs require no less than two boundaries (chains of one or more Boundary Lines)."
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StairOnlyOneConnectedBoundary { get; }
  Visual Basic
Public Shared ReadOnly Property StairOnlyOneConnectedBoundary As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StairOnlyOneConnectedBoundary {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace